src/main/resources/cdm-sample-files/dtcc-11-0/DDL_NewTrade3.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/  ../../schemas/dtcc-11-0/soap-envelope.xsd"
        xmlns:fpml="http://www.fpml.org/2010/FpML-4-9"  xmlns:rm="OTC_RM_11-0"
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"  xmlns:mtc="OTC_Matching_11-0">
    <env:Header>
        <OTC_RM
            xmlns="OTC_RM_11-0">
            <Manifest>
                <TradeMsg>
                    <Activity>New</Activity>
                    <Status>Confirmed</Status>
                    <TransType>Trade</TransType>
                    <ProductType>CreditDefaultSwapIndex</ProductType>
                    <Submitter>
                        <partyTradeIdentifier>
                            <fpml:partyReference href="DTCC00005678"/>
                            <fpml:tradeId tradeIdScheme="TradeRefNbr">204069260</fpml:tradeId>
                            <fpml:tradeId tradeIdScheme="MCPTransactionID">MSERV20181022.0005217595</fpml:tradeId>
                        </partyTradeIdentifier>
                    </Submitter>
                    <ContraTradeId>
                        <partyTradeIdentifier>
                            <fpml:partyReference href="DTCC00001234"/>
                            <fpml:tradeId tradeIdScheme="TradeRefNbr">4876781</fpml:tradeId>
                            <fpml:tradeId tradeIdScheme="MCPTransactionID">MSERV20181022.0005217595</fpml:tradeId>
                        </partyTradeIdentifier>
                    </ContraTradeId>
                    <USI>
                        <USIIssuer issuerIdScheme="http://www.fpml.org/coding-scheme/external/cftc/issuer-identifier">M710DSN29N</USIIssuer>
                        <USITradeId tradeIdScheme="http://www.fpml.org/coding-scheme/external/unique-transaction-identifier">1TTRVD82HTWGNT13LB8QG2G6L0DDN5SA</USITradeId>
                    </USI>
                    <OriginatingUSI>
                        <USIIssuer issuerIdScheme="http://www.fpml.org/coding-scheme/external/cftc/issuer-identifier"/>
                        <USITradeId tradeIdScheme="http://www.fpml.org/coding-scheme/external/unique-transaction-identifier"/>
                    </OriginatingUSI>
                </TradeMsg>
                <MsgId>MSERV20181022.0005217595</MsgId>
            </Manifest>
            <Delivery>
                <RouteInfo>
                    <From>MarkitSERV</From>
                    <To>DTCC</To>
                </RouteInfo>
                <RouteHist>
                    <Route>
                        <RouteAddress>www.markitserv.net</RouteAddress>
                        <ReceiveTime>2018-10-22T05:45:24.382-04:00</ReceiveTime>
                        <ReleaseTime>2018-10-22T05:45:36.689-04:00</ReleaseTime>
                    </Route>
                </RouteHist>
            </Delivery>
        </OTC_RM>
    </env:Header>
    <env:Body>
        <OTC_Matching
            xmlns="OTC_Matching_11-0">
            <Activity>New</Activity>
            <Status>Confirmed</Status>
            <WarehouseState>
                <WarehouseStatus>Submit</WarehouseStatus>
                <WarehousePositionType>Gold</WarehousePositionType>
            </WarehouseState>
            <Trade>
                <FpML version="4-9" xmlns="http://www.fpml.org/2010/FpML-4-9"
                      xmlns:dsig="http://www.w3.org/2000/09/xmldsig#"
                      xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                      xsi:schemaLocation="http://www.fpml.org/2010/FpML-4-9 ../../schemas/fpml-4-9/fpml-main-4-9.xsd
					   http://www.w3.org/2000/09/xmldsig# ../../schemas/fpml-4-9/xmldsig-core-schema.xsd"
                      xsi:type="RequestTradeConfirmation">
                    <header>
                        <messageId messageIdScheme="perFpMLReqmt">MSERV20181022.0005217595</messageId>
                        <sentBy>DTCC00005678</sentBy>
                        <sendTo>DTCC00001234</sendTo>
                        <creationTimestamp>2018-10-22T09:45:36.701Z</creationTimestamp>
                    </header>
                    <trade>
                        <tradeHeader
                            xmlns="http://www.fpml.org/2010/FpML-4-9">
                            <partyTradeIdentifier>
                                <fpml:partyReference href="DTCC00005678"/>
                                <fpml:tradeId tradeIdScheme="TradeRefNbr">204069260</fpml:tradeId>
                                <fpml:tradeId tradeIdScheme="MCPTransactionID">MSERV20181022.0005217595</fpml:tradeId>
                            </partyTradeIdentifier>
                            <partyTradeIdentifier>
                                <fpml:partyReference href="DTCC00001234"/>
                                <fpml:tradeId tradeIdScheme="TradeRefNbr">4876781</fpml:tradeId>
                                <fpml:tradeId tradeIdScheme="MCPTransactionID">MSERV20181022.0005217595</fpml:tradeId>
                            </partyTradeIdentifier>
                            <tradeDate>2018-10-08</tradeDate>
                        </tradeHeader>
                        <creditDefaultSwap>
                            <generalTerms>
                                <effectiveDate>
                                    <fpml:unadjustedDate>2018-03-20</fpml:unadjustedDate>
                                    <fpml:dateAdjustments>
                                        <fpml:businessDayConvention>NotApplicable</fpml:businessDayConvention>
                                    </fpml:dateAdjustments>
                                </effectiveDate>
                                <scheduledTerminationDate>
                                    <fpml:adjustableDate>
                                        <fpml:unadjustedDate>2023-06-20</fpml:unadjustedDate>
                                        <fpml:dateAdjustments>
                                            <businessDayConvention>NotApplicable</businessDayConvention>
                                        </fpml:dateAdjustments>
                                    </fpml:adjustableDate>
                                </scheduledTerminationDate>
                                <sellerPartyReference href="DTCC00001234"/>
                                <buyerPartyReference href="DTCC00005678"/>
                                <indexReferenceInformation>
                                    <fpml:indexName indexNameScheme="http://www.fpml.org/spec/2003/entity-name-RED">CDX.NA.IG.30</fpml:indexName>
                                    <fpml:indexId indexIdScheme="http://www.fpml.org/spec/2003/instrument-id-RED-pair">2I65BYDP7</fpml:indexId>
                                    <indexAnnexDate>2018-03-20</indexAnnexDate>
                                </indexReferenceInformation>
                            </generalTerms>
                            <feeLeg>
                                <initialPayment>
                                    <payerPartyReference href="DTCC00005678"/>
                                    <receiverPartyReference href="DTCC00001234"/>
                                    <paymentAmount>
                                        <currency currencyScheme="http://www.fpml.org/ext/iso4217">USD</currency>
                                        <amount>123456.00000</amount>
                                    </paymentAmount>
                                </initialPayment>
                                <periodicPayment>
                                    <fixedAmountCalculation>
                                        <fixedRate>0.0100000000</fixedRate>
                                    </fixedAmountCalculation>
                                </periodicPayment>
                            </feeLeg>
                            <protectionTerms>
                                <calculationAmount id="calculationAmount">
                                    <currency currencyScheme="http://www.fpml.org/ext/iso4217">USD</currency>
                                    <amount>5000000.00000</amount>
                                </calculationAmount>
                            </protectionTerms>
                        </creditDefaultSwap>
                        <calculationAgent>
                            <calculationAgentPartyReference href="DTCC00001234"/>
                        </calculationAgent>
                        <documentation>
                            <masterAgreement>
                                <masterAgreementType masterAgreementTypeScheme="http://dtcc.com/coding-scheme/master-agreement-type">ISDA</masterAgreementType>
                                <masterAgreementVersion masterAgreementVersionScheme="http://www.fpml.org/coding-scheme/master-agreement-version">1992</masterAgreementVersion>
                                <masterAgreementDate>1992-09-04</masterAgreementDate>
                            </masterAgreement>
                            <contractualDefinitions contractualDefinitionsScheme="http://www.fpml.org/coding-scheme/contractual-definitions">ISDA2014Credit</contractualDefinitions>
                            <contractualTermsSupplement>
                                <type contractualSupplementScheme="http://www.fpml.org/coding-scheme/contractual-supplement">CDX</type>
                                <publicationDate>2014-09-22</publicationDate>
                            </contractualTermsSupplement>
                        </documentation>
                    </trade>
                    <party id="DTCC00005678">
                        <fpml:partyId partyIdScheme="DTCC">DTCC00005678</fpml:partyId>
                        <fpml:partyId partyIdScheme="http://www.fpml.org/coding-scheme/external/iso17442">DTCCRR3QWICWWIPCS8A4S074</fpml:partyId>
                    </party>
                    <party id="DTCC00001234">
                        <fpml:partyId partyIdScheme="DTCC">DTCC00001234</fpml:partyId>
                        <fpml:partyId partyIdScheme="http://www.fpml.org/coding-scheme/external/iso17442">DTCCDGQCSV2PHVF7I2743539</fpml:partyId>
                    </party>
                </FpML>
            </Trade>
            <WorkflowData>
                <partyReference href="DTCC00001234"/>
                <PartyWorkflowFields>
                    <superId>Bilateral</superId>
                    <deskId>KCEC407</deskId>
                </PartyWorkflowFields>
            </WorkflowData>
            <ReportingData>
                <ReportingHeader>
                    <ReportingJurisdiction>
                        <UTI>
                            <UTIIssuer issuerIdScheme="http://www.fpml.org/coding-scheme/external/issuer-identifier">M710DSN29N</UTIIssuer>
                            <UTITradeId tradeIdScheme="http://www.fpml.org/coding-scheme/external/unique-transaction-identifier">1TTRVD82HTWGNT13LB8QG2G6L0DDN5SA</UTITradeId>
                        </UTI>
                    </ReportingJurisdiction>
                </ReportingHeader>
            </ReportingData>
        </OTC_Matching>
    </env:Body>
</env:Envelope>